[Jedi X2SoldierClassTemplate]
+DisplayName="Jedi"
+ClassSummary="The Jedi are the guardians of peace and justice in the Galactic Republic. Falling to the Dark Side of the Force many Jedi become Sith. The Sith are the ancient enemies of the Jedi Order and fought numerous wars with them for thousands of years."
+LeftAbilityTreeTitle="Light"
+RightAbilityTreeTitle="Dark"
AbilityTreeTitles[0]="Light"
AbilityTreeTitles[1]="Grey"
AbilityTreeTitles[2]="Dark"
AbilityTreeTitles[3]="Battlemaster"


+RankNames[0]=
+RankNames[1]=Initiate
+RankNames[2]=Padawan
+RankNames[3]=Knight
+RankNames[4]=Guardian
+RankNames[5]=Sentinel
+RankNames[6]=Consular
+RankNames[7]=Master
+RankNames[8]=Grand Master

+ShortNames[0]=
+ShortNames[1]=Initiate
+ShortNames[2]=Padawan
+ShortNames[3]=Knight
+ShortNames[4]=Guardian
+ShortNames[5]=Sentinel
+ShortNames[6]=Consular
+ShortNames[7]=Master
+ShortNames[8]=Grand Master


+RankIcons[0]=""
+RankIcons[1]="JediClassUI.Ranks.rank_Initiate"
+RankIcons[2]="JediClassUI.Ranks.rank_Padawan"
+RankIcons[3]="JediClassUI.Ranks.rank_Knight"
+RankIcons[4]="JediClassUI.Ranks.rank_Guardian"
+RankIcons[5]="JediClassUI.Ranks.rank_Sentinel"
+RankIcons[6]="JediClassUI.Ranks.rank_Consular"
+RankIcons[7]="JediClassUI.Ranks.rank_Master"
+RankIcons[8]="JediClassUI.Ranks.rank_GrandMaster"

+RandomNickNames[0]=""
+RandomNickNames[1]=""
+RandomNickNames[2]=""
+RandomNickNames[3]=""
+RandomNickNames[4]=""
+RandomNickNames[5]=""
+RandomNickNames[6]=""
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""


[Lightsaber_CV X2WeaponTemplate]
FriendlyName="Lightsaber"
FriendlyNamePlural="Lightsabers"
BriefSummary="A lightsaber is an elegant weapon for a more civilized age, not as clumsy or random as a blaster."
TacticalText=""
AbilityDescName="Lightsaber"

[Lightsaber_MG X2WeaponTemplate]
FriendlyName="Knight Lightsaber"
FriendlyNamePlural="Knight Lightsabers"
BriefSummary="This is an advanced lightsaber, the weapon of a Jedi Knight. The frame has been reinforced and the wire gauge increased to handle additional power."
TacticalText=""
AbilityDescName="Knight Lightsaber"

[Lightsaber_BM X2WeaponTemplate]
FriendlyName="Master Lightsaber"
FriendlyNamePlural="Master Lightsabers"
BriefSummary="The lightsaber of a Jedi Master is a tool of immense power. This saber's frame has been further reinforced. The sheer amount of power coursing through it has also necessitated the removal of any wire shielding."
TacticalText=""
AbilityDescName="Master Lightsaber"

[Saberstaff_CV X2WeaponTemplate]
+FriendlyName="Apprentice's Saberstaff"
+BriefSummary="This basic saberstaff emits a beam filtered through a Kathracite crystal. Little more effective than a sword, it is a suitable weapon for an apprentice."
+TacticalText="<Bullet/> A difficult weapon to wield, the saberstaff is also unpredictable to adversaries who may find themselves surprised by its devastating strikes."
+AbilityDescName="Saberstaff"

[Saberstaff_MG X2WeaponTemplate]
+FriendlyName="Knight's Saberstaff"
+BriefSummary="The Pontite variety of Adegan crystal used in this saberstaff is attuned to the force, creating a bond between the wielder, the weapon and the force. It is a weapon suitable for an experienced saber wielder."
+TacticalText="<Bullet/> A difficult weapon to wield, the saberstaff is also unpredictable to adversaries who may find themselves surprised by its devastating strikes. \n<Bullet/> Armor penetration: 1."
+AbilityDescName="Saberstaff"

[Saberstaff_BM X2WeaponTemplate]
+FriendlyName="Master's Saberstaff"
+BriefSummary="This saberstaff has been enhanced with a Kyber crystal, the rarest and most potent of lightsaber crystals. Wielding this weapon enhances one’s affinity with the force significantly, and thereby makes the wielder even more effective in combat. It is a weapon suitable for a master."
+TacticalText="<Bullet/> A difficult weapon to wield, the saberstaff is also unpredictable to adversaries who may find themselves surprised by its devastating strikes. \n<Bullet/> Armor penetration: 2."
+AbilityDescName="Saberstaff"

[Holocron_CV X2WeaponTemplate]
FriendlyName="Holocron"
FriendlyNamePlural="Holocrons"
BriefSummary="Holocrons were information-storage devices used by both the Jedi Order and the Sith that contained ancient lessons or valuable information in holographic form. They appeared as palm-sized, glowing polyhedrons of crystalline material and hardware, and could only be activated and used through the power of the Force."
TacticalText="Holocrons were information-storage devices used by both the Jedi Order and the Sith that contained ancient lessons or valuable information in holographic form. They appeared as palm-sized, glowing polyhedrons of crystalline material and hardware, and could only be activated and used through the power of the Force."
AbilityDescName="Holocron"

[Holocron_MG X2WeaponTemplate]
FriendlyName="Knight Holocron"
FriendlyNamePlural="Knight Holocrons"
BriefSummary="Holocrons were information-storage devices used by both the Jedi Order and the Sith that contained ancient lessons or valuable information in holographic form. They appeared as palm-sized, glowing polyhedrons of crystalline material and hardware, and could only be activated and used through the power of the Force."
TacticalText="Holocrons were information-storage devices used by both the Jedi Order and the Sith that contained ancient lessons or valuable information in holographic form. They appeared as palm-sized, glowing polyhedrons of crystalline material and hardware, and could only be activated and used through the power of the Force."
AbilityDescName="Holocron"

[Holocron_BM X2WeaponTemplate]
FriendlyName="Master Holocron"
FriendlyNamePlural="Master Holocrons"
BriefSummary="Holocrons were information-storage devices used by both the Jedi Order and the Sith that contained ancient lessons or valuable information in holographic form. They appeared as palm-sized, glowing polyhedrons of crystalline material and hardware, and could only be activated and used through the power of the Force."
TacticalText="Holocrons were information-storage devices used by both the Jedi Order and the Sith that contained ancient lessons or valuable information in holographic form. They appeared as palm-sized, glowing polyhedrons of crystalline material and hardware, and could only be activated and used through the power of the Force."
AbilityDescName="Holocron"


[BattlePrecognition X2AbilityTemplate]
LocFriendlyName="Battle Precognition"
LocFlyOverText="Battle Precognition"
LocLongDescription="Melee overwatch enemies within blue move range"
LocHelpText="Melee overwatch enemies within blue move range"
LocPromotionPopupText="<Bullet/>Melee overwatch enemies within blue move range"

[BattlePrecognitionLeapStrike X2AbilityTemplate]
LocFriendlyName="Battle Precognition"
LocFlyOverText="Battle Precognition"
LocLongDescription="Melee overwatch enemies within blue move range"
LocHelpText="Melee overwatch enemies within blue move range"
LocPromotionPopupText="<Bullet/>Melee overwatch enemies within blue move range"
LocHitMessage="Battle Precognition"

[ForceJump X2AbilityTemplate]
LocFriendlyName="Force Jump"
LocFlyOverText="Force Jump"
LocLongDescription="Use the force to jump over great distances"
LocHelpText="Use the force to jump over great distances"
LocPromotionPopupText="<Bullet/>Use the force to jump over great distances"

[ForceChoke X2AbilityTemplate]
LocFriendlyName="Force Choke"
LocFlyOverText="Force Choke"
LocLongDescription="Telekintec strangle the victim with this dark force power from afar. <Ability:ForceAlignment/>"
LocHelpText="Telekintec strangle the victim with this dark force power from afar."
LocPromotionPopupText="<Bullet/>Telekintec strangle the victim with this dark force power from afar.<br /><Bullet/><Ability:ForceAlignment/>"

[ForceLightning X2AbilityTemplate]
LocFriendlyName="Force Lightning"
LocFlyOverText="Force Lightning"
LocLongDescription="Channel you hatred and anger and realease a devastating force lightnin. <Ability:ForceAlignment/>"
LocHelpText="Channel you hatred and anger and realease a devastating force lightning "
LocPromotionPopupText="<Bullet/>Cause damage on a succesful psi offense vs will contest<br /><Bullet/>Can also target civilians and squad mates. This shifts your force alignment to the dark side.<br /><Bullet/><Ability:ForceAlignment/>"

[ForceChainLightning X2AbilityTemplate]
LocFriendlyName="Chain Lightning"
LocFlyOverText="Chain Lightning"
LocLongDescription="Channel you hatred and anger and realease a devastating force lightning that hit multiple enemies. <Ability:ForceAlignment/>"
LocHelpText="Channel you hatred and anger and realease a devastating force lightning that hit multiple enemies"
LocPromotionPopupText="<Bullet/>Causes damage to ever unit in sight which fails a psi offense vs will contest<br /><Bullet/>Can also target civilians and squad mates. This shifts your force alignment to the dark side. <br /><Bullet/><Ability:ForceAlignment/>"

[ForcePush X2AbilityTemplate]
LocFriendlyName="Force Push"
LocFlyOverText="Force Push"
LocLongDescription="Use the force to push a target away from you. This basic force power will always hit, can cancel overwatch, has a chance to stun the target and applies minimal damage. <Ability:ForceAlignment/>"
LocHelpText="Use the force to push a target away from you. This basic force power will always hit, can cancel overwatch, has a chance to stun the target and applies minimal damage"
LocPromotionPopupText="<Bullet/>Can apply stun<br /><Bullet/>Cancel overwatch and viper bounds<br /><Bullet/>Does not end turn<br /><Bullet/>Guaranteed hit<br /><Bullet/><Ability:Cooldown< /> Cooldown<br /><Bullet/><Ability:ForceAlignment/>"

[ForceWind X2AbilityTemplate]
LocFriendlyName="Force Wind"
LocFlyOverText="Force Wind"
LocLongDescription="Use the force to push multiple targets away from you and cause environment devastation. This advanced force power will always hit, can cancel overwatch, has a chance to stun the target and applies some damage. <Ability:ForceAlignment/>"
LocHelpText="Use the force to push multiple targets away from you and cause environment devastation. This advanced force power will always hit, can cancel overwatch, has a chance to stun the target and applies some damage."
LocPromotionPopupText="<Bullet/>Can apply stun<br /><Bullet/>Cancel overwatch and viper bounds<br /><Bullet/>Guaranteed hit<br /><Bullet/><Ability:Cooldown< /> Cooldown<br /><Bullet/><Ability:ForceAlignment/>"

[ForceJumpTraversal X2AbilityTemplate]
LocFriendlyName="Force Jump"
LocFlyOverText="Force Jump"
LocLongDescription="The Jedi can jump incredible heights with the help of the force"
LocHelpText="The Jedi can jump incredible heights with the help of the force"
LocPromotionPopupText="<Bullet/>Allows to jump on buildings without a ladder or pipe"

[MindTricks X2AbilityTemplate]
LocFriendlyName="Jedi Mind Tricks"
LocFlyOverText="Jedi Mind Tricks"
LocLongDescription="Affect the mind of the weak reducing the move, sight and detection range to zero. This force power does not break concealment. <Ability:ForceAlignment/>"
LocHelpText="Affect the mind of the weak reducing the move, sight and detection range to zero. This force power does not break concealment."
LocFlyOverText="Jedi Mind Trick"
LocMissMessage="Jedi Mind Trick Failed"
LocPromotionPopupText="<Bullet/>Cone AOE effect that reduces the move, sight and detection range to zero if successfull. The ability does not break concealment.<br /><Bullet/><Ability:Cooldown< /> Cooldown<br /><Bullet/><Ability:ForceAlignment/>"

[ForceHeal X2AbilityTemplate]
LocFriendlyName="Force Heal"
LocFlyOverText="Force Heal"
LocLongDescription="Heal allies or self with the force. Also removes negative status effects and revives bleeding out squadmates. <Ability:ForceAlignment/>"
LocHelpText="Heal allies or self with the force. Also removes negative status effects and revives bleeding out squadmates."
LocPromotionPopupText="<Bullet/>Heals Units<br /><Bullet/>Heals target<br /><Bullet/>Removes negative status effects<br /><Bullet/>Recovers target from unconsciousness and bleeding out<br /><Bullet/>Using force heal on squad mates shifts your force alignment to the lightside<br /><Bullet\><Ability:ForceAlignment/>"

[MindControl X2AbilityTemplate]
LocFriendlyName="Mind Control"
LocFlyOverText="Mind Control"
LocLongDescription="Gain complete control over your friends and enemies. <Ability:ForceAlignment/>"
LocHelpText="Gain complete control over your friends and enemies."
LocPromotionPopupText="<Bullet/>Gain complete control over your friends and enemies<br/><Bullet/>Can also target civilians and squad mates. This shifts your force alignment to the dark side.<br/><Bullet/><Ability:ForceAlignment/>"

[ForceSpeed X2AbilityTemplate]
LocFriendlyName="Force Speed"
LocFlyOverText="Force Speed"
LocLongDescription="Take three actions this turn, and no action is turn-ending."
LocHelpText="Take three actions this turn, and no action is turn-ending."
LocPromotionPopupText="<Bullet/>Take three actions this turn, and no action is turn-ending.</br>"

[ForceFear X2AbilityTemplate]
LocFriendlyName="Force Fear"
LocFlyOverText="Force Fear"
LocLongDescription="The wielder strikes directly at the deepest parts of the target's mind, causing an uncontrollable shaking fear that wreak havoc with the target's capabilities. This power is so subtle that its use does not break concealment. <Ability:ForceAlignment/>"
LocHelpText="The wielder strikes directly at the deepest parts of the target's mind, causing an uncontrollable shaking fear that wreak havoc with the target's capabilities. This power is so subtle that its use does not break concealment."
LocPromotionPopupText="<Bullet/>Cone AOE attack that may cause organic enemies to panic.</br><Bullet/>Does not break concealment.</br><Bullet/>Can also target civilians and squad mates. This shifts your force alignment to the dark side. <br /><Bullet/><Ability:ForceAlignment/>"

[LeapStrike X2AbilityTemplate]
LocFriendlyName="Leap Strike"
LocFlyOverText="Leap Strike"
LocLongDescription="The Jedi uses the force to leap to the target and immediately attack with the lightsaber without triggering reaction fire."
LocHelpText="The Jedi uses the force to leap to the target and immediately attack with the lightsaber without triggering reaction fire."
LocPromotionPopupText="<Bullet/>The Jedi uses the force to leap to the target and immediately attack with the lightsaber without triggering reaction fire.</br>"

[LeapStrikeFleche X2AbilityTemplate]
LocFriendlyName="Leap Strike Bonus"
LocFlyOverText="Leap Strike"
LocLongDescription="The Jedi receives a bonus to damage on Leap Strikes based on the distance between their starting position and their target."
LocHelpText="The Jedi receives a bonus to damage on Leap Strikes based on the distance between their starting position and their target."

[LightsaberSlash X2AbilityTemplate]
LocFriendlyName="Lightsaber Slash"
LocFlyOverText="Lightsaber Slash"
LocLongDescription="Attack an adjacent target with your Lightsaber. Uses one action."
LocHelpText="Attack an adjacent target with your Lightsaber. Uses one action."
LocPromotionPopupText="<Bullet/> Attack an adjacent target with your Lightsaber.<br/><Bullet/> Uses one action and doesn't automatically end your turn, so two attacks a turn are possible."

[EnergyAbsorption X2AbilityTemplate]
LocFriendlyName="Energy Absorption"
LocFlyOverText="Energy Absorption"
LocLongDescription="You are skilled at absorbing incoming energy with the force. You are granted 5 energy shield points."
LocHelpText="You are skilled at absorbing incoming energy with the force. You are granted 5 energy shield points."
LocPromotionPopupText="<Bullet/>You are granted 5 energy shield points.</br>"

[BattleMeditation X2AbilityTemplate]
LocFriendlyName="Battle Meditation"
LocFlyOverText="Battle Meditation"
LocLongDescription="When in the state of battle meditation the jedi is capable of of deflecting or reflecting every incoming shot. <Ability:ForceAlignment/>"
LocHelpText="When in the state of battle meditation the jedi is capable of of deflecting or reflecting every incoming shot."
LocPromotionPopupText="<Bullet/>Unlimited reflections/deflections for one enemy turn</br><Bullet/><Ability:ForceAlignment/>"

[MindControl X2AbilityTemplate]
LocFriendlyName="Mind Control"
LocLongDescription="Permanently mind control an enemy. Only one successful Domination can be performed per mission."
LocHelpText="Permanently mind control an enemy. Only one successful Domination can be performed per mission."
LocFlyOverText="Mind Control"
LocMissMessage="Mind Control Failed"
LocPromotionPopupText="<Bullet/> Domination requires a contest of the Psi Operative's Psi Strength stat versus the Will of the target.<br/><Bullet/> If an attempted Domination fails, there is a 4 turn coldown before another Domination can be attempted.<br/><Bullet/> If the Psi Operative dies or leaves the battlefield, the Domination is broken.<br/>"

[ForceSense X2AbilityTemplate]
LocFriendlyName="Force Sense"
LocLongDescription="Sense nearby units even without line of sight. Force sense will reveal concealed and burrowed enemies."
LocHelpText="Sense nearby units even without line of sight. Force sense will reveal concealed and burrowed enemies."
LocFlyOverText="Force Sense"
LocPromotionPopupText="<Bullet/>Sense enemies outside normal visual range.<br/><Bullet/> Force sense will reveal concealed and burrowed enemies.<br/>"

[ForceProtection X2AbilityTemplate]
LocFriendlyName="Force Protection"
LocLongDescription="A power only achieved by high-rank Jedi, Force Protection made the bearer invulnerable to a wide range of attacks. The Jedi is immune to fire, poison, acid, and explosive damage."
LocHelpText="The Jedi is immune to fire, poison, acid, and explosive damage."
LocFlyOverText="Force Protection"
LocPromotionPopupText="<Bullet/>A Jedi with the Force Protection ability can walk through fire, poison and acid with no ill effects.<br/>"

[Slash_LW X2AbilityTemplate]
LocFriendlyName="Slash"
LocFlyOverText="Slash"
LocLongDescription="Attack an adjacent target with your sword. Uses one action."
LocHelpText="Attack an adjacent target with your sword. Uses one action."
LocPromotionPopupText="<Bullet/>Attack an adjacent target with your sword.<br/><Bullet/> Uses one action and doesn't automatically end your turn, so two attacks a turn are possible."

[ForceDrain X2AbilityTemplate]
LocFriendlyName="Force Drain"
LocFlyOverText="Force Drain"
LocLongDescription="Drain the life of targets around you to heal yourself. <Ability:ForceAlignment/>"
LocHelpText="Drain the life of targets around you to heal yourself."
LocPromotionPopupText="<Bullet/>AOE effect around you<br /><Bullet/>Heal a hit point for every point of damage you cause.<br /><Bullet/><Ability:ForceAlignment/>"

[LightsaberDeflect X2AbilityTemplate]
LocFriendlyName="Deflect"
LocLongDescription="The Jedi has a chance to deflect incoming shots with their <Ability:WeaponName/>"
LocHelpText="The Jedi has a chance to deflect incoming shots with their <Ability:WeaponName/>"
LocFlyOverText="Lightsaber Deflect"
LocPromotionPopupText="<Bullet/>The Jedi has a chance to deflect incoming shots with their <Ability:WeaponName/>"

[LightsaberReflect X2AbilityTemplate]
LocFriendlyName="Reflect"
LocLongDescription="The Jedi has a chance to reflect incoming shots with their <Ability:WeaponName/> at the attacking enemy or to simply deflect them away."
LocHelpText="The Jedi has a chance to reflect incoming shots with their <Ability:WeaponName/> at the attacking enemy or to simply deflect them away."
LocFlyOverText="Lightsaber Reflect"
LocPromotionPopupText="<Bullet/>The Jedi has a chance to reflect incoming shots with their <Ability:WeaponName/> at the attacking enemy or to simply deflect them away."

[LightsaberToss X2AbilityTemplate]
LocFriendlyName="Lightsaber Toss"
LocLongDescription="Throw the lightsaber at an enemy and return it with the force"
LocHelpText="Throw the lightsaber at an enemy and return it with the force"
LocFlyOverText="Lightsaber Toss"
LocPromotionPopupText="<Bullet/>"

[LightsaberTelekinesis X2AbilityTemplate]
LocFriendlyName="Lightsaber Telekinesis"
LocLongDescription="Throw the lightsaber at all visible enemies and return it with the force"
LocHelpText="Throw the lightsaber at visible enemies and return it with the force"
LocFlyOverText="Lightsaber Master"
LocPromotionPopupText="<Bullet/>"

[ForcePowerPool X2AbilityTemplate]
LocFriendlyName="Force Power"
LocLongDescription="The measurement of a Jedi's attunement to the living Force, and what allows them to use Force Powers."
LocHelpText="The measurement of a Jedi's attunement to the living Force, and what allows them to use Force Powers."
LocFlyOverText="Force Power"
LocPromotionPopupText="<Bullet/> The Jedi starts battle with Force Points based upon their rank."

[ForceMeditate X2AbilityTemplate]
LocFriendlyName="Force Meditation"
LocLongDescription="Enter a trance, reattuning your connection with the Force but leaving yourself vulnerable to attack. Meditation removes negative mental effects like Disorientation and Dazed"
LocHelpText="Enter a trance, reattuning your connection with the Force but leaving yourself vulnerable to attack. Meditation removes negative mental effects like Disorientation and Dazed"
LocFlyOverText="Force Meditation"
LocPromotionPopupText="<Bullet/> Regenerate all Force Points.<br /><Bullet/> Lose the ability to dodge until the start of the next turn.<br /><Bullet/>Removes negative mental effects like Disorientation and Dazed"

[ForcePoolBonusDamage X2AbilityTemplate]
LocFriendlyName="Force Pool"

[HolocronPool_CV X2AbilityTemplate]
LocFriendlyName="Padawan Holocron"
LocLongDescription="A Jedi carrying a Padawan Holocron is more attuned to the Force, providing a 33% bonus to Force Points."
LocHelpText="A Jedi carrying a Padawan Holocron is more attuned to the Force, providing a 33% bonus to Force Points."

[HolocronPool_MG X2AbilityTemplate]
LocFriendlyName="Knight Holocron"
LocLongDescription="A Jedi carrying a Knight Holocron is even more attuned to the Force than a Padawan is, providing a 66% bonus to Force Points."
LocHelpText="A Jedi carrying a Knight Holocron is even more attuned to the Force than a Padawan is, providing a 66% bonus to Force Points."

[HolocronPool_BM X2AbilityTemplate]
LocFriendlyName="Master Holocron"
LocLongDescription="A Master Holocron is a Consular's greatest asset in channeling Force Powers, providing a 100% bonus to Force Points."
LocHelpText="A Master Holocron is a Consular's greatest asset in channeling Force Powers, providing a 100% bonus to Force Points."

[DeflectBonusSaberStaff_CV X2AbilityTemplate]
LocFriendlyName="Enhanced Deflection"
LocLongDescription="The dual blades of the saberstaff grant a deflection bonus of +10%."
LocHelpText="The dual blades of the saberstaff grant a deflection bonus of +10%."

[DeflectBonusSaberStaff_MG X2AbilityTemplate]
LocFriendlyName="Enhanced Deflection"
LocLongDescription="The dual blades of the saberstaff grant a deflection bonus of +15%."
LocHelpText="The dual blades of the saberstaff grant a deflection bonus of +15%."

[DeflectBonusSaberStaff_BM X2AbilityTemplate]
LocFriendlyName="Enhanced Deflection"
LocLongDescription="The dual blades of the saberstaff grant a deflection bonus of +20%."
LocHelpText="The dual blades of the saberstaff grant a deflection bonus of +20%."

[UpgradeDiamond_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Diamond"
FriendlyNamePlural="Diamonds"
BriefSummary="This common diamond is an inadequate substitute for a proper lightsaber crystal, but unless we take from the aliens, it's all we have."
TinySummary="Increased Damage"

[UpgradeAdeganCrystal_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Adegan Crystal"
FriendlyNamePlural="Adegan Crystals"
BriefSummary="Adegan crystals, also called Ilum crystals, are one of the most common lightsaber focusing crystals."
TinySummary=""

[UpgradeAnkarresSapphire_Adv X2WeaponUpgradeTemplate]
FriendlyName="Ankarres Sapphire"
FriendlyNamePlural="Ankarres Sapphires"
BriefSummary="This crystal possesses legendary healing powers and numerous other effects. It is one of the most potent crystals that can be used in lightsaber creation."
TinySummary=""

[UpgradeBarabOreIngot_Adv X2WeaponUpgradeTemplate]
FriendlyName="Barab Ore Ingot"
FriendlyNamePlural="Barab Ore Ingots"
BriefSummary="When placed in a lightsaber, these ingots, having been exposed to massive radiation, produce a blade that burns almost to the point of losing its cohesion."
TinySummary=""

[UpgradeBondarCrystal_Adv X2WeaponUpgradeTemplate]
FriendlyName="Bondar Crystal"
FriendlyNamePlural="Bondar Crystals"
BriefSummary="This crystal was mined on a far-orbit asteroid circling the Alderaan system. It produces a volatile lightsaber beam that pulses on impact, potentially stunning an opponent."
TinySummary=""

[UpgradeDamindCrystal_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Damind Crystal"
FriendlyNamePlural="Damind Crystals"
BriefSummary="Found on the desert world of Daminia, this crystal can be used in lightsaber construction to produce a clearly defined beam of subtly wider width and length."
TinySummary=""

[UpgradeDragiteCrystal_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Dragite Crystal"
FriendlyNamePlural="Dragite Crystals"
BriefSummary="Dragite crystals are found on M'haeli, in the D'olop mountain range. The beam they create resonates loudly when it strikes, inflicting a minor amount of sonic damage."
TinySummary=""

[UpgradeEralamCrystal_Adv X2WeaponUpgradeTemplate]
FriendlyName="Eralam Crystal"
FriendlyNamePlural="Eralam Crystals"
BriefSummary="Once mined on the third moon of Erai, ancient Sith bombardment shattered much that remained. If they can be found, these crystals produce a clear, superior lightsaber beam."
TinySummary=""

[UpgradeFirkrannCrystal_Sup X2WeaponUpgradeTemplate]
FriendlyName="Firkrann Crystal"
FriendlyNamePlural="Firkrann Crystals"
BriefSummary="This heavy crystal is collected by the natives of Rafa V. If used in lightsaber construction it produces an electrically charged beam that is devastating to droids."
TinySummary=""

[UpgradeHurrikaineCrystal_Sup X2WeaponUpgradeTemplate]
FriendlyName="Hurrikaine Crystal"
FriendlyNamePlural="Hurrikaine Crystals"
BriefSummary="The very rare Hurrikaine crystal is best known for its unparalleled beauty. When used in a lightsaber, the dark gemstone creates a devastating beam that can partially penetrate any defenses."
TinySummary=""

[UpgradeJenruaxCrystal_Sup X2WeaponUpgradeTemplate]
FriendlyName="Jenruax Crystal"
FriendlyNamePlural="Jenruax Crystals"
BriefSummary="The refined form of Opila, this crystal has been cleansed of all impurities. When used in lightsaber construction it produces a blade of unerring quickness."
TinySummary=""

[UpgradeKaiburrCrystal_Adv X2WeaponUpgradeTemplate]
FriendlyName="Kaiburr Crystal"
FriendlyNamePlural="Kaiburr Crystals"
BriefSummary="Perhaps the most powerful crystal that can be used in a lightsaber, the Kaiburr gem bestows insight and fortitute upon its owner."
TinySummary=""

[UpgradeKashaCrystal_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Kasha Crystal"
FriendlyNamePlural="Kasha Crystals"
BriefSummary="This crystal is traditionally used by the Cereans as a meditation tool. When used as a lightsaber crystal, it helps clear the wielder's mind of distractions, even during tense combat."
TinySummary=""

[UpgradeLorrdianGemstone_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Lorrdian Gemstone"
FriendlyNamePlural="Lorrdian Gemstones"
BriefSummary="During their subjugation, the Lorrdians were banned from speaking to each other and thus learned to use subtle gestures and ticks to communicate. These gems have been imprinted with that ability."
TinySummary=""

[UpgradeNextorCrystal_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Nextor Crystal"
FriendlyNamePlural="Nextor Crystals"
BriefSummary="This crystal is mined in the mountains of planet M'haeli, and when used in lightsaber construction it produces a volatile blade that can cause surprising amounts of damage."
TinySummary=""

[UpgradeOpilaCrystal_Sup X2WeaponUpgradeTemplate]
FriendlyName="Opila Crystal"
FriendlyNamePlural="Opila Crystals"
BriefSummary="Found in the asteroid fields of the Fyrth system, this crystal can be used in lightsaber construction to produce an intense beam that seems extraordinarily quick to the cut."
TinySummary=""

[UpgradePhondCrystal_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Phond Crystal"
FriendlyNamePlural="Phond Crystals"
BriefSummary="The strange byproduct of rare impurities bonding during the making of certain alloys and some random external condition, this crystal produces a fiercely burning lightsaber beam."
TinySummary=""

[UpgradePontiteCrystal_Adv X2WeaponUpgradeTemplate]
FriendlyName="Pontite Crystal"
FriendlyNamePlural="Pontite Crystals"
BriefSummary="Pontite is one of the rarest forms of Adegan crystal. It radiates a powerful aura that cools both skin and tempers."
TinySummary=""

[UpgradeQixoniCrystal_Sup X2WeaponUpgradeTemplate]
FriendlyName="Qixoni Crystal"
FriendlyNamePlural="Qixoni Crystals"
BriefSummary="Qixoni crystals were formed on a planet that was destroyed millenia ago when its star went supernova. They are exceedingly rare and also quite powerful."
TinySummary=""

[UpgradeRubatCrystal_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Rubat Crystal"
FriendlyNamePlural="Rubat Crystals"
BriefSummary="Used in lightsaber construction, rubat crystal is mined on Phemis. It produces a clearly defined blade that a Jedi can easily track, making it easier to hit opponents."
TinySummary=""

[UpgradeRuusanCrystal_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Ruusan Crystal"
FriendlyNamePlural="Ruusan Crystals"
BriefSummary="Ruusan crystals come from the Mid Rim planet of the same name. While not directly affecting a lightsaber's effectiveness, they aid a Jedi in focusing the Force."
TinySummary=""

[UpgradeSapithCrystal_Adv X2WeaponUpgradeTemplate]
FriendlyName="Sapith Crystal"
FriendlyNamePlural="Sapith Crystals"
BriefSummary="This crystallized material was excreted once every 11 years by the ancient Volice worm of Lwhekk, now extinct. It produces a more intense lightsaber beam, granting better control."
TinySummary=""

[UpgradeSigilCrystal_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Sigil Crystal"
FriendlyNamePlural="Sigil Crystals"
BriefSummary="Mined in the Sigil System, this crystal is a costly but valued addition to a lightsaber. It produces a fiercely bright beam that sears on contact, inflicting great damage."
TinySummary=""

[UpgradeSolariCrystal_Sup X2WeaponUpgradeTemplate]
FriendlyName="Solari Crystal"
FriendlyNamePlural="Solari Crystals"
BriefSummary="An artifact of true light side power, only those Jedi who are pure in spirit can wield a lightsaber equipped with this gleaming white gem."
TinySummary=""

[UpgradeStygiumCrystal_Adv X2WeaponUpgradeTemplate]
FriendlyName="Stygium Crystal"
FriendlyNamePlural="Stygium Crystals"
BriefSummary="The stygium mineral can be used to create cloaking effects that foil enemy sensors. In its pure crystal form, it is suitable for a lightsaber."
TinySummary=""

[UpgradeUltimaPearl_Sup X2WeaponUpgradeTemplate]
FriendlyName="Ultima Pearl"
FriendlyNamePlural="Ultima Pearls"
BriefSummary="An unusual choice for a lightsaber focusing crystal, this rare stone can be found on Calamari. Difficult to properly install in a lightsaber, this valuable stone has powerful effects."
TinySummary=""

[UpgradeUpariCrystal_Adv X2WeaponUpgradeTemplate]
FriendlyName="Upari Crystal"
FriendlyNamePlural="Upari Crystals"
BriefSummary="Strangely, this crystal is usually encountered scattered in the orbit of primarily forest worlds. It is brittle but versatile, and a Master Jedi can get it to produce many effects."
TinySummary=""

[UpgradeVelmoriteCrystal_Adv X2WeaponUpgradeTemplate]
FriendlyName="Velmorite Crystal"
FriendlyNamePlural="Velmorite Crystals"
BriefSummary="Found only on the planet Velmor, these crystals produce a very fine beam that is easy to wield skillfully."
TinySummary=""

[UpgradeDiatiumCell_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Diatium Energy Cell"
FriendlyNamePlural="Diatium Energy Cells"
BriefSummary="This power cell modifies the energy output of lightsabers, allowing skilled users to better deliver powerful attacks."
TinySummary="Increased Damage"

[UpgradeDiatiumCell_Adv X2WeaponUpgradeTemplate]
FriendlyName="Upgraded Diatium Energy Cell"
FriendlyNamePlural="Upgraded Diatium Energy Cells"
BriefSummary="This power cell modifies the energy output of lightsabers, allowing skilled users to better deliver powerful attacks."
TinySummary="Increased Damage"

[UpgradeDiatiumCell_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Diatium Energy Cell"
FriendlyNamePlural="Superior Diatium Energy Cells"
BriefSummary="This power cell modifies the energy output of lightsabers, allowing skilled users to better deliver powerful attacks."
TinySummary="Increased Damage"

[UpgradeDiatiumCell_Ult X2WeaponUpgradeTemplate]
FriendlyName="Ultimate Diatium Energy Cell"
FriendlyNamePlural="Ultimate Diatium Energy Cells"
BriefSummary="This power cell modifies the energy output of lightsabers, allowing skilled users to better deliver powerful attacks."
TinySummary="Increased Damage"

[UpgradeDischargeCell_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Discharge Energy Cell"
FriendlyNamePlural="Discharge Energy Cells"
BriefSummary="This power cell modifies the energy output of lightsabers, allowing precise users to better deliver powerful attacks."
TinySummary="Increased Critical Damage"

[UpgradeDischargeCell_Adv X2WeaponUpgradeTemplate]
FriendlyName="Upgraded Discharge Energy Cell"
FriendlyNamePlural="Upgraded Discharge Energy Cells"
BriefSummary="This power cell modifies the energy output of lightsabers, allowing precise users to better deliver powerful attacks."
TinySummary="Increased Critical Damage"

[UpgradeDischargeCell_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Discharge Energy Cell"
FriendlyNamePlural="Superior Discharge Energy Cells"
BriefSummary="This power cell modifies the energy output of lightsabers, allowing precise users to better deliver powerful attacks."
TinySummary="Increased Critical Damage"

[UpgradeIonCell_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Ion Energy Cell"
FriendlyNamePlural="Ion Energy Cells"
BriefSummary="This power cell modifies the energy output of lightsabers, allowing skilled users to better deliver damaging attacks."
TinySummary="Increased Piercing"

[UpgradeIonCell_Adv X2WeaponUpgradeTemplate]
FriendlyName="Upgraded Ion Energy Cell"
FriendlyNamePlural="Upgraded Ion Energy Cells"
BriefSummary="This power cell modifies the energy output of lightsabers, allowing skilled users to better deliver damaging attacks."
TinySummary="Increased Piercing"

[UpgradeIonCell_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Ion Energy Cell"
FriendlyNamePlural="Superior Ion Energy Cells"
BriefSummary="This power cell modifies the energy output of lightsabers, allowing skilled users to better deliver damaging attacks."
TinySummary="Increased Piercing"

[UpgradeJoltCell_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Jolt Energy Cell"
FriendlyNamePlural="Jolt Energy Cells"
BriefSummary="This power cell modifies the energy output of lightsabers, allowing skilled users to better deliver precise attacks."
TinySummary="Increased Critical Chance"

[UpgradeJoltCell_Adv X2WeaponUpgradeTemplate]
FriendlyName="Upgraded Jolt Energy Cell"
FriendlyNamePlural="Upgraded Jolt Energy Cells"
BriefSummary="This power cell modifies the energy output of lightsabers, allowing skilled users to better deliver precise attacks."
TinySummary="Increased Critical Chance"

[UpgradeJoltCell_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Jolt Energy Cell"
FriendlyNamePlural="Superior Jolt Energy Cells"
BriefSummary="This power cell modifies the energy output of lightsabers, allowing skilled users to better deliver precise attacks."
TinySummary="Increased Critical Chance"

[UpgradeFocusEmitter_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Focusing Emitter"
FriendlyNamePlural="Focusing Emitters"
BriefSummary="Focusing emitters focus the blade into a thinner, more devastating blade, allowing skilled users to deliver powerful attacks."
TinySummary="Increased Damage"

[UpgradeFocusEmitter_Adv X2WeaponUpgradeTemplate]
FriendlyName="Upgraded Focusing Emitter"
FriendlyNamePlural="Upgraded Focusing Emitters"
BriefSummary="Focusing emitters focus the blade into a thinner, more devastating blade, allowing skilled users to deliver powerful attacks."
TinySummary="Increased Damage"

[UpgradeFocusEmitter_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Focusing Emitter"
FriendlyNamePlural="Superior Focusing Emitters"
BriefSummary="Focusing emitters focus the blade into a thinner, more devastating blade, allowing skilled users to deliver powerful attacks."
TinySummary="Increased Damage"

[UpgradeDisruptEmitter_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Disruption Emitter"
FriendlyNamePlural="Disruption Emitters"
BriefSummary="Disruption emitters create an unsteady beam which can wreak havoc on a victim's protective shell or armor."
TinySummary="Increased Armor Shred"

[UpgradeDisruptEmitter_Adv X2WeaponUpgradeTemplate]
FriendlyName="Upgraded Disruption Emitter"
FriendlyNamePlural="Upgraded Disruption Emitters"
BriefSummary="Disruption emitters create an unsteady beam which can wreak havoc on a victim's protective shell or armor."
TinySummary="Increased Armor Shred"

[UpgradeDisruptEmitter_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Disruption Emitter"
FriendlyNamePlural="Superior Disruption Emitters"
BriefSummary="Disruption emitters create an unsteady beam which can wreak havoc on a victim's protective shell or armor."
TinySummary="Increased Armor Shred"

[UpgradePhobiumEmitter_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Phobium Emitter"
FriendlyNamePlural="Phobium Emitters"
BriefSummary="Made for the more aggressive combatant, the phobium emitter creates a wider, thicker blade than the typical emitter. It is also indisputably more effective."
TinySummary="Increased Critical Chance"

[UpgradePhobiumEmitter_Adv X2WeaponUpgradeTemplate]
FriendlyName="Upgraded Phobium Emitter"
FriendlyNamePlural="Upgraded Phobium Emitters"
BriefSummary="Made for the more aggressive combatant, the phobium emitter creates a wider, thicker blade than the typical emitter. It is also indisputably more effective."
TinySummary="Increased Critical Chance"

[UpgradePhobiumEmitter_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Phobium Emitter"
FriendlyNamePlural="Superior Phobium Emitters"
BriefSummary="Made for the more aggressive combatant, the phobium emitter creates a wider, thicker blade than the typical emitter. It is also indisputably more effective."
TinySummary="Increased Critical Chance"

[UpgradePhobiumEmitter_Ult X2WeaponUpgradeTemplate]
FriendlyName="Ultimate Phobium Emitter"
FriendlyNamePlural="Ultimate Phobium Emitters"
BriefSummary="Made for the more aggressive combatant, the phobium emitter creates a wider, thicker blade than the typical emitter. It is also indisputably more effective."
TinySummary="Increased Critical Chance"

[UpgradeFencingEmitter_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Fencing Emitter"
FriendlyNamePlural="Fencing Emitters"
BriefSummary="Fencing emitters are most suitable for those who wish to end a battle in a single strike."
TinySummary="Increased Critical Damage"

[UpgradeFencingEmitter_Adv X2WeaponUpgradeTemplate]
FriendlyName="Upgraded Fencing Emitter"
FriendlyNamePlural="Upgraded Fencing Emitters"
BriefSummary="Fencing emitters are most suitable for those who wish to end a battle in a single strike."
TinySummary="Increased Critical Damage"

[UpgradeFencingEmitter_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Fencing Emitter"
FriendlyNamePlural="Superior Fencing Emitters"
BriefSummary="Fencing emitters are most suitable for those who wish to end a battle in a single strike."
TinySummary="Increased Critical Damage"

[UpgradeBeamGemLens_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Beam Gem Lens"
FriendlyNamePlural="Beam Gem Lenses"
BriefSummary="The aptly named beam gem crystals are common in optical computers such as those involved in navigational systems. Not surprisingly, they also can create a highly focused lightsaber beam."
TinySummary="Increased Damage"

[UpgradeBeamGemLens_Adv X2WeaponUpgradeTemplate]
FriendlyName="Upgraded Beam Gem Lens"
FriendlyNamePlural="Upgraded Beam Gem Lenses"
BriefSummary="The aptly named beam gem crystals are common in optical computers such as those involved in navigational systems. Not surprisingly, they also can create a highly focused lightsaber beam."
TinySummary="Increased Damage"

[UpgradeBeamGemLens_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Beam Gem Lens"
FriendlyNamePlural="Superior Beam Gem Lenses"
BriefSummary="The aptly named beam gem crystals are common in optical computers such as those involved in navigational systems. Not surprisingly, they also can create a highly focused lightsaber beam."
TinySummary="Increased Damage"

[UpgradeByrothsisLens_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Byrothsis Lens"
FriendlyNamePlural="Byrothsis Lenses"
BriefSummary="Byrothsis was originally used to created infrared camera lenses, but has since found use in other applications, including lightsaber lenses."
TinySummary="Increased Armor Shred"

[UpgradeByrothsisLens_Adv X2WeaponUpgradeTemplate]
FriendlyName="Upgraded Byrothsis Lens"
FriendlyNamePlural="Upgraded Byrothsis Lenses"
BriefSummary="Byrothsis was originally used to created infrared camera lenses, but has since found use in other applications, including lightsaber lenses."
TinySummary="Increased Armor Shred"

[UpgradeByrothsisLens_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Byrothsis Lens"
FriendlyNamePlural="Superior Byrothsis Lenses"
BriefSummary="Byrothsis was originally used to created infrared camera lenses, but has since found use in other applications, including lightsaber lenses."
TinySummary="Increased Armor Shred"

[UpgradeDuelingLens_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Dueling Lens"
FriendlyNamePlural="Dueling Lenses"
BriefSummary="The dueling lens was meant to focus a lightsaber into a finely tuned blade meant for dueling and other instances where complete control is needed."
TinySummary="Increased Piercing"

[UpgradeDuelingLens_Adv X2WeaponUpgradeTemplate]
FriendlyName="Upgraded Dueling Lens"
FriendlyNamePlural="Upgraded Dueling Lenses"
BriefSummary="The dueling lens was meant to focus a lightsaber into a finely tuned blade meant for dueling and other instances where complete control is needed."
TinySummary="Increased Piercing"

[UpgradeDuelingLens_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Dueling Lens"
FriendlyNamePlural="Superior Dueling Lenses"
BriefSummary="The dueling lens was meant to focus a lightsaber into a finely tuned blade meant for dueling and other instances where complete control is needed."
TinySummary="Increased Piercing"

[UpgradeDuelingLens_Ult X2WeaponUpgradeTemplate]
FriendlyName="Ultimate Dueling Lens"
FriendlyNamePlural="Ultimate Dueling Lenses"
BriefSummary="The dueling lens was meant to focus a lightsaber into a finely tuned blade meant for dueling and other instances where complete control is needed."
TinySummary="Increased Piercing"

[UpgradeVibrationLens_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Vibration Lens"
FriendlyNamePlural="Vibration Lenses"
BriefSummary="This lens vibrates very rapidly, resulting in a less stable, but more deadly beam."
TinySummary="Increased Critical Damage and Armor Shredding"

[UpgradeVibrationLens_Adv X2WeaponUpgradeTemplate]
FriendlyName="Upgraded Vibration Lens"
FriendlyNamePlural="Upgraded Vibration Lenses"
BriefSummary="This lens vibrates very rapidly, resulting in a less stable, but more deadly beam."
TinySummary="Increased Critical Damage and Armor Shredding"

[UpgradeVibrationLens_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Vibration Lens"
FriendlyNamePlural="Superior Vibration Lenses"
BriefSummary="This lens vibrates very rapidly, resulting in a less stable, but more deadly beam."
TinySummary="Increased Critical Damage and Armor Shredding"

[Lightsaber_CV_Project X2TechTemplate]
DisplayName="Apprentice Lightsaber"
Summary="With the discovery of Force-related abilities, we should develop a weapon with the means to help those with the gift channel those abilities. Similar to psionic amplifiers, these 'light sabers' would utilize an array of foci, along with a focusing crystal not unlike those in ADVENT weapons, to create a beam of light." 

[Lightsaber_MG_Project X2TechTemplate]
DisplayName="Knight Lightsaber"
Summary="The increasing strength of the ADVENT and alien forces necessitates the creation of a new Jedi weapon. While fundamentally the same as the previous version - given that the internal, switchable components are what provide most of the tangible benefit - the redesigned housing itself should allow for increased control when attacking." 

[Lightsaber_BM_Project X2TechTemplate]
DisplayName="Master Lightsaber"
Summary="Utilizing newer techniques learned from the study of psionically-adept ADVENT and alien forces, we believe there are new avenues to explore in relation to lightsaber tech. As before, the benefit would probably be minor, but any benefit is better than none." 